out/logs_fanout/ab_fanout100_run1.log
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking maximal-beach-473712-d1.ew.r.appspot.com (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Finished 500 requests


Server Software:        Google
Server Hostname:        maximal-beach-473712-d1.ew.r.appspot.com
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-ECDSA-CHACHA20-POLY1305,256,256
Server Temp Key:        ECDH X25519 253 bits
TLS Server Name:        maximal-beach-473712-d1.ew.r.appspot.com

Document Path:          /api/timeline?user=fanout100_1&limit=20
Document Length:        44 bytes

Concurrency Level:      50
Time taken for tests:   34.941 seconds
Complete requests:      500
Failed requests:        0
Total transferred:      157020 bytes
HTML transferred:       22000 bytes
Requests per second:    14.31 [#/sec] (mean)
Time per request:       3494.105 [ms] (mean)
Time per request:       69.882 [ms] (mean, across all concurrent requests)
Transfer rate:          4.39 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       43   76  31.8     65     347
Processing:   904 2874 1888.8   2364   10809
Waiting:      903 2872 1889.0   2363   10809
Total:        968 2950 1893.2   2455   10902

Percentage of the requests served within a certain time (ms)
  50%   2455
  66%   3140
  75%   3513
  80%   3900
  90%   5578
  95%   7237
  98%   8915
  99%   9550
 100%  10902 (longest request)