out/logs_fanout/ab_fanout10_run2.log
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking maximal-beach-473712-d1.ew.r.appspot.com (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Finished 500 requests


Server Software:        Google
Server Hostname:        maximal-beach-473712-d1.ew.r.appspot.com
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-ECDSA-CHACHA20-POLY1305,256,256
Server Temp Key:        ECDH X25519 253 bits
TLS Server Name:        maximal-beach-473712-d1.ew.r.appspot.com

Document Path:          /api/timeline?user=fanout10_1&limit=20
Document Length:        43 bytes

Concurrency Level:      50
Time taken for tests:   3.655 seconds
Complete requests:      500
Failed requests:        0
Total transferred:      156504 bytes
HTML transferred:       21500 bytes
Requests per second:    136.78 [#/sec] (mean)
Time per request:       365.540 [ms] (mean)
Time per request:       7.311 [ms] (mean, across all concurrent requests)
Transfer rate:          41.81 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       44   69  20.6     62     171
Processing:    42  264  66.3    264     425
Waiting:       39  263  66.2    263     425
Total:        112  333  61.9    334     535

Percentage of the requests served within a certain time (ms)
  50%    334
  66%    357
  75%    378
  80%    387
  90%    406
  95%    421
  98%    436
  99%    462
 100%    535 (longest request)