out/logs_fanout/ab_fanout50_run1.log
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking maximal-beach-473712-d1.ew.r.appspot.com (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Finished 500 requests


Server Software:        Google
Server Hostname:        maximal-beach-473712-d1.ew.r.appspot.com
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-ECDSA-CHACHA20-POLY1305,256,256
Server Temp Key:        ECDH X25519 253 bits
TLS Server Name:        maximal-beach-473712-d1.ew.r.appspot.com

Document Path:          /api/timeline?user=fanout50_1&limit=20
Document Length:        43 bytes

Concurrency Level:      50
Time taken for tests:   70.664 seconds
Complete requests:      500
Failed requests:        0
Total transferred:      156528 bytes
HTML transferred:       21500 bytes
Requests per second:    7.08 [#/sec] (mean)
Time per request:       7066.413 [ms] (mean)
Time per request:       141.328 [ms] (mean, across all concurrent requests)
Transfer rate:          2.16 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       43   63  30.6     53     326
Processing:   574 6245 1093.3   6476    8892
Waiting:      574 6244 1093.5   6475    8890
Total:        628 6308 1083.5   6530    9039

Percentage of the requests served within a certain time (ms)
  50%   6530
  66%   6623
  75%   6688
  80%   6738
  90%   6822
  95%   6932
  98%   7069
  99%   7688
 100%   9039 (longest request)