out/logs_fanout/ab_fanout50_run2.log
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking maximal-beach-473712-d1.ew.r.appspot.com (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Finished 500 requests


Server Software:        Google
Server Hostname:        maximal-beach-473712-d1.ew.r.appspot.com
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-ECDSA-CHACHA20-POLY1305,256,256
Server Temp Key:        ECDH X25519 253 bits
TLS Server Name:        maximal-beach-473712-d1.ew.r.appspot.com

Document Path:          /api/timeline?user=fanout50_1&limit=20
Document Length:        43 bytes

Concurrency Level:      50
Time taken for tests:   39.203 seconds
Complete requests:      500
Failed requests:        0
Total transferred:      156516 bytes
HTML transferred:       21500 bytes
Requests per second:    12.75 [#/sec] (mean)
Time per request:       3920.332 [ms] (mean)
Time per request:       78.407 [ms] (mean, across all concurrent requests)
Transfer rate:          3.90 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       43   81  64.1     57     527
Processing:   494 3593 2154.2   2695    6905
Waiting:      492 3592 2153.5   2694    6905
Total:        537 3674 2155.2   2800    7049

Percentage of the requests served within a certain time (ms)
  50%   2800
  66%   4947
  75%   6404
  80%   6517
  90%   6673
  95%   6785
  98%   6898
  99%   6937
 100%   7049 (longest request)