out/logs_fanout/ab_fanout50_run2.log
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking maximal-beach-473712-d1.ew.r.appspot.com (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Finished 500 requests


Server Software:        Google
Server Hostname:        maximal-beach-473712-d1.ew.r.appspot.com
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-ECDSA-CHACHA20-POLY1305,256,256
Server Temp Key:        ECDH X25519 253 bits
TLS Server Name:        maximal-beach-473712-d1.ew.r.appspot.com

Document Path:          /api/timeline?user=fanout50_1&limit=20
Document Length:        43 bytes

Concurrency Level:      50
Time taken for tests:   47.397 seconds
Complete requests:      500
Failed requests:        0
Total transferred:      156516 bytes
HTML transferred:       21500 bytes
Requests per second:    10.55 [#/sec] (mean)
Time per request:       4739.715 [ms] (mean)
Time per request:       94.794 [ms] (mean, across all concurrent requests)
Transfer rate:          3.22 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       42   54  18.1     48     270
Processing:   848 3942 2172.5   3671   10017
Waiting:      848 3942 2172.5   3670   10017
Total:        896 3996 2170.4   3719   10062

Percentage of the requests served within a certain time (ms)
  50%   3719
  66%   4377
  75%   5063
  80%   5591
  90%   7612
  95%   8086
  98%   8615
  99%   9132
 100%  10062 (longest request)